In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', 'British Airways.','12. Air France', "Swiss Air"]})

In [3]:
df

            From_To  FlightNumber  RecentDelays            Airline
0      LoNDon_paris       10045.0      [23, 47]             KLM(!)
1      MAdrid_miLAN           NaN            []  <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]   British Airways.
3    Budapest_PaRis           NaN          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
df.iloc[[1,3],[1]]=[10055.0,10075.0]

In [5]:
df

            From_To  FlightNumber  RecentDelays            Airline
0      LoNDon_paris       10045.0      [23, 47]             KLM(!)
1      MAdrid_miLAN       10055.0            []  <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]   British Airways.
3    Budapest_PaRis       10075.0          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [6]:
df['FlightNumber']=df['FlightNumber'].apply(np.int64)

In [7]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [8]:
df

            From_To  FlightNumber  RecentDelays            Airline
0      LoNDon_paris         10045      [23, 47]             KLM(!)
1      MAdrid_miLAN         10055            []  <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]   British Airways.
3    Budapest_PaRis         10075          [13]     12. Air France
4   Brussels_londOn         10085      [67, 32]          Swiss Air

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [9]:
df1=df.From_To.apply(lambda x:pd.Series(str(x).split("_")))

In [10]:
df1

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [11]:
df1.rename(columns={0:'From',1:'To'},inplace='True')
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [12]:
df1['From']=df1.From.apply(lambda x:pd.Series(str(x).capitalize()))

In [13]:
df1

       From         To
0    London      paris
1    Madrid      miLAN
2    London  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [14]:
df.drop('From_To',axis=1,inplace=True)

In [15]:
df=pd.concat([df,df1],axis=1)

In [16]:
df

   FlightNumber  RecentDelays            Airline      From         To
0         10045      [23, 47]             KLM(!)    London      paris
1         10055            []  <Air France> (12)    Madrid      miLAN
2         10065  [24, 43, 87]   British Airways.    London  StockhOlm
3         10075          [13]     12. Air France  Budapest      PaRis
4         10085      [67, 32]          Swiss Air  Brussels     londOn

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [17]:
df2=(pd.DataFrame(df.pop('RecentDelays').values.tolist(),index=df.index).rename(columns=lambda x:'delay_{}'.format(x+1)))
df=df.join(df2)
df

TypeError: 'list' object is not callable